app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
    def index
        courses = Course.all

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    def show
        course = Course.find(params[:id])