app/controllers/meetings_controller.rb

SELECT "meetings".* FROM "meetings"
---
    def index
        meetings = Meeting.all

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def show
        meeting = Meeting.find(params[:id])