app/controllers/user_courses_controller.rb

SELECT "user_courses".* FROM "user_courses"
---
    def index
        user_courses = UserCourse.all